// mdc 正则表达式 https://developer.mozilla.org/zh-CN/docs/Web/JavaScript/Guide/Regular_expressions
const practiceList = [
  // 描述 正则 测试数据
  ['验证姓名，2 到 9 位中文昵称', /^[\u4e00-\u9fa5]{2,9}$/, '罗蓉蓉'],
  ['验证密码，允许字母、数字、下划线', /^\w+$/, '343r34_r43g'],
  [
    '验证密码，允许 小写字母 a-z、大写字母 A-Z、数字 0-9、下划线 _、 连接符 -，且长度在 6-18 位数',
    /^[a-zA-Z\d_-]{6,18}$/,
    '34gG3-r34_r43g',
  ],
  [
    '验证密码，必须包含数字+小写字母+大写字母的密码，且长度在8-10位之间',
    /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z\d]{8,10}$/,
    '12345AaBb',
  ],
  //
  ['验证 Email', /\w+@\w+\.[a-zA-Z]{2,}/, 'lrr102108@qq.com'],
  [
    '验证身份证，15位身份证；或者18位身份证，尾部是数字或X或x',
    /^([1-9]\d{14}|[1-9]\d{16}[\dXx])$/,
    '42080420001201220x',
  ],
  ['验证手机号，11位', /^1\d{10}$/, '13344556677'],
  ['与搜索字符串开始处的 3 个数字匹配', /^\d{3}/, '123fdsfda'],
  ['与除 a、b 和 c 以外的任何字符匹配', /[^abc]/, 'abd'],
  ['不以“th”开头的单词匹配', /\b(?!th)\w+\b/g, 'there is some'],
  [
    '对密码应用以下限制：其长度必须介于 4 到 8 个字符之间，并且必须至少包含一个数字',
    /^(?=.*\d).{4,8}$/,
    'a3bcdefg',
  ],
  ['匹配美元', /^\$[1-9]\d*(\.\d{1,2})?$/, '$9.99'],
  ['匹配24小时制时间', /^([01]?[0-9]|2[0-3]):[0-5][0-9]$/, '23:59'],
  ['匹配IP地址', //, ''],
  ['匹配html tag', /<\w+(?:\s+(\w+)=("[^"]*"|'[^']*'))*>/, '<div name="fff" value="<" test="ffffffff">'],
];
practiceList.forEach(([desc, reg, value]) => {
  console.log(desc, reg.test(value));
});

console.log('"1234567".match(/d{1,3}/g)的结果', '1234567'.match(/\d{1,3}/g));


// 用了零宽先行断言
console.log(
  '匹配IP地址',
  /^(?!0+\.0+\.0+\.0+$)(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])$/.test(
    '0.0.0.0'
  )
);

