console.log('与搜索字符串开始处的 3 个数字匹配', /^\d{3}/.test('d122dd'));

console.log('与除 a、b 和 c 以外的任何字符匹配', /[^abc]/.test('abd'));

console.log('"1234567".match(/\d{1,3}/g)的结果', '1234567'.match(/\d{1,3}/g));

console.log('不以“th”开头的单词匹配', /\b(?!th)\w+\b/.test('athe'));

console.log('对密码应用以下限制：其长度必须介于 4 到 8 个字符之间，并且必须至少包含一个数字', /^(?=.*\d).{4,8}$/.test('a3bcdefg'));

console.log('匹配美元', /^\$[0-9]+(\.[0-9][0-9])?$/.test('$9.99'))

console.log('匹配24小时制时间', /\b(?:[01]?[0-9]|2[0-3]):[0-5][0-9]\b/.test('21:50'))

// 用了零宽先行断言
console.log('匹配IP地址', /^(?!0+\.0+\.0+\.0+$)(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])\.(?:[01]?\d\d?|2[0-4]\d|25[0-5])$/.test('0.0.0.0'))


console.log('匹配html tag', /<\w+(?:"[^"]*"|'[^']*'|[^'">])*>/.test('<input name=123 value=">" >'))
